# Parameters
nc: 1  # number of classes
scales: 
  n: [1.0, 1.0, 768]  # scale parameters (unchanged)

# Backbone using ConvNeXt-Small (single scale output)
backbone:
  - [-1, 1, Timm, [768, 'convnext_small.in12k_ft_in1k', True, True, 0, True]]  # 0
  - [-1, 1, Index, [768, 3]]  # 1 - Only use P5 (768 ch @ 30x30)
  - [-1, 1, SPPF, [768, 5]]    # 2
  - [-1, 2, C2PSA, [768]]      # 3

# Simplified head (single scale processing)
head:
  # Feature refinement
  - [-1, 3, C3Ghost, [768]]     # 4 - Process final features
  
  # Detection heads (combine cls + reg)
  - [-1, 1, GhostConv, [768, 3, 1]]  # 5 - Final feature refinement
  - [[-1], 1, Detect, [nc]]     # 6 - Single-scale Detect