nc: 80
scales:
  n: [0.5, 1.0, 512]

backbone:
  # 0: full convnextv2_nano outputs
  - [-1, 1, Timm, [256, 'tf_efficientnetv2_s.in21k_ft_in1k', True, True, 0, True, 0.2]]
  # use layers 1, 2, 3 from the backbone:
  - [0, 1, Index, [64, 2]]   # P3 → 128 
  - [0, 1, Index, [160, 3]]   # P4 → 160 
  - [0, 1, Index, [256, 4]]   # P5 → 256 
  # SPPF & PSA on P5
  - [-1, 1, SPPF, [256, 5]]
  - [-1, 2, C2PSA, [256]]

head:
  # P5 → upsample → concat with P4 → C3k2
  - [5,    1, nn.Upsample, [None, 2, "nearest"]]   
  - [[6, 2], 1, Concat,        [1]]                
  - [7,    2, C3k2,            [160, False]]        

  # P4 → upsample → concat with P3 → C3k2
  - [8,    1, nn.Upsample, [None, 2, "nearest"]]   
  - [[9, 1], 1, Concat,       [1]]                 
  - [10,   2, C3k2,            [64, False]]        

  # top-down → bottom-up
  - [11,   1, Conv,            [64, 3, 2]]         
  - [[12, 8], 1, Concat,       [1]]                
  - [13,   2, C3k2,            [160, False]]        

  # bottom-up → P5
  - [14,   1, Conv,            [160, 3, 2]]        
  - [[15, 5], 1, Concat,       [1]]                
  - [16,   2, C3k2,            [256, True]]         

  # Final Detect on (P3=11, P4=14, P5=17)
  - [[11, 14, 17], 1, Detect,   [nc]]